# Import data

Data source:
https://datahack.analyticsvidhya.com/contest/practice-problem-loan-prediction-iii/

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

# Examine data

In [3]:
df.shape

(614, 13)

In [4]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [5]:
df.describe(include='all')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,614,601,611,599,614,582,614.000000,614.000000,592.000000,600.00000,564.000000,614,614
unique,614,2,2,4,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001835,Male,Yes,0,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,489,398,345,480,500,NaN,NaN,NaN,NaN,NaN,233,422
mean,NaN,NaN,NaN,NaN,NaN,NaN,5403.459283,1621.245798,146.412162,342.00000,0.842199,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,6109.041673,2926.248369,85.587325,65.12041,0.364878,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,150.000000,0.000000,9.000000,12.00000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,2877.500000,0.000000,100.000000,360.00000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,3812.500000,1188.500000,128.000000,360.00000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,5795.000000,2297.250000,168.000000,360.00000,1.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,81000.000000,41667.000000,700.000000,480.00000,1.000000,NaN,NaN

In [7]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [8]:
print(df['Loan_Amount_Term'].unique())

[360. 120. 240.  nan 180.  60. 300. 480.  36.  84.  12.]

In [9]:
print(df['Gender'].unique())
print(df['Married'].unique())
print(df['Education'].unique())
print(df['Self_Employed'].unique())
print(df['Property_Area'].unique())

['Male' 'Female' nan]
['No' 'Yes' nan]
['Graduate' 'Not Graduate']
['No' 'Yes' nan]
['Urban' 'Rural' 'Semiurban']

**Observations**
 - There is some missing data: Gender, Married, Dependents, Self_Employed, LoanAmount, Loan_Amount_Term, Credit_History
 - No irregular categorical values except for nulls.
 - Loan_ID is not needed for modeling since it is a unique id.

In [7]:
df_interpolate = df

In [8]:
# Interpolate data for categorical variables - greatest frequency
df_interpolate['Gender'].\
fillna(df_interpolate['Gender'].mode().iloc[0], inplace=True)

df_interpolate['Married'].\
fillna(df_interpolate['Married'].mode().iloc[0], inplace=True)

df_interpolate['Self_Employed'].\
fillna(df_interpolate['Self_Employed'].mode().iloc[0], inplace=True)

df_interpolate['Dependents'].\
fillna(df_interpolate['Dependents'].mode().iloc[0], inplace=True)

In [9]:
# Interpolate data for numeric variables - median
df_interpolate['LoanAmount'].\
fillna((df_interpolate['LoanAmount'].median()), inplace=True)

## Special case: Terms are fixed amounts (categorical)
df_interpolate['Loan_Amount_Term'].\
fillna((df_interpolate['Loan_Amount_Term'].mode().iloc[0]), 
       inplace=True)


df_interpolate['Credit_History'].\
fillna((df_interpolate['Credit_History'].median()), inplace=True)

In [10]:
df_interpolate.describe(include='all')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,614,614,614,614,614,614,614.000000,614.000000,614.000000,614.000000,614.000000,614,614
unique,614,2,2,4,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001835,Male,Yes,0,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,502,401,360,480,532,NaN,NaN,NaN,NaN,NaN,233,422
mean,NaN,NaN,NaN,NaN,NaN,NaN,5403.459283,1621.245798,145.752443,342.410423,0.855049,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,6109.041673,2926.248369,84.107233,64.428629,0.352339,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,150.000000,0.000000,9.000000,12.000000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,2877.500000,0.000000,100.250000,360.000000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,3812.500000,1188.500000,128.000000,360.000000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,5795.000000,2297.250000,164.750000,360.000000,1.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,81000.000000,41667.000000,700.000000,480.000000,1.000000,NaN,NaN

 - Missing values have been imputed using median (for continuous values) and the most frequent value (for categorical values)

# Feature Engineering

 - List of categorical features: Gender, Married, Education, Self_Employed, Property_Area

In [11]:
# Get dummies dataframe on categorical data
gender_dummies = pd.get_dummies(df.Gender)
print(gender_dummies.columns)
gender_dummies = gender_dummies.add_prefix('Gender_')
gender_dummies.drop('Gender_Male', axis=1, inplace=True)
gender_dummies.head()

Index(['Female', 'Male'], dtype='object')

   Gender_Female
0              0
1              0
2              0
3              0
4              0

In [12]:
marital_dummies = pd.get_dummies(df.Married)
print(marital_dummies.columns)
marital_dummies = marital_dummies.add_prefix('Married_')
marital_dummies.drop('Married_No', axis=1, inplace=True)
marital_dummies.head()

Index(['No', 'Yes'], dtype='object')

   Married_Yes
0            0
1            1
2            1
3            1
4            0

In [13]:
education_dummies = pd.get_dummies(df.Education)
print(education_dummies.columns)
education_dummies = education_dummies.add_prefix('Education_')
education_dummies.drop('Education_Not Graduate', axis=1, inplace=True)
education_dummies.head()

Index(['Graduate', 'Not Graduate'], dtype='object')

   Education_Graduate
0                   1
1                   1
2                   1
3                   0
4                   1

In [14]:
self_employed_dummies = pd.get_dummies(df.Self_Employed)
print(self_employed_dummies.columns)
self_employed_dummies = self_employed_dummies.\
add_prefix('Self_Employed_')
self_employed_dummies.drop('Self_Employed_No', axis=1, inplace=True)
self_employed_dummies.head()

Index(['No', 'Yes'], dtype='object')

   Self_Employed_Yes
0                  0
1                  0
2                  1
3                  0
4                  0

In [15]:
property_area_dummies = pd.get_dummies(df.Property_Area)
print(property_area_dummies.columns)
property_area_dummies = property_area_dummies\
.add_prefix('Property_Area_')
property_area_dummies.drop('Property_Area_Semiurban', 
                           axis=1, inplace=True)
property_area_dummies.head()

Index(['Rural', 'Semiurban', 'Urban'], dtype='object')

   Property_Area_Rural  Property_Area_Urban
0                    0                    1
1                    1                    0
2                    0                    1
3                    0                    1
4                    0                    1

In [16]:
dependents_dummies = pd.get_dummies(df.Dependents)
print(dependents_dummies.columns)
dependents_dummies = dependents_dummies\
.add_prefix('Dependents_')
dependents_dummies.drop('Dependents_3+', 
                        axis=1, inplace=True)
dependents_dummies.head()

Index(['0', '1', '2', '3+'], dtype='object')

   Dependents_0  Dependents_1  Dependents_2
0             1             0             0
1             0             1             0
2             1             0             0
3             1             0             0
4             1             0             0

In [17]:
# Combined DF of all categorical cols
categorical_cols = pd.concat([gender_dummies, marital_dummies,
                             education_dummies, self_employed_dummies,
                             property_area_dummies, dependents_dummies],
                            axis=1)
print(categorical_cols.shape)
categorical_cols.head()

(614, 9)

,Gender_Female,Married_Yes,Education_Graduate,Self_Employed_Yes,Property_Area_Rural,Property_Area_Urban,Dependents_0,Dependents_1,Dependents_2
0,0,0,1,0,0,1,1,0,0
1,0,1,1,0,1,0,0,1,0
2,0,1,1,1,0,1,1,0,0
3,0,1,0,0,0,1,1,0,0
4,0,0,1,0,0,1,1,0,0

In [18]:
df_fnl = pd.concat([df_interpolate, categorical_cols], axis=1)
print(df_fnl.shape)
df_fnl.head()

(614, 22)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,...,Loan_Status,Gender_Female,Married_Yes,Education_Graduate,Self_Employed_Yes,Property_Area_Rural,Property_Area_Urban,Dependents_0,Dependents_1,Dependents_2
0,LP001002,Male,No,0,Graduate,No,5849,0.0,128.0,360.0,...,Y,0,0,1,0,0,1,1,0,0
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,...,N,0,1,1,0,1,0,0,1,0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,...,Y,0,1,1,1,0,1,1,0,0
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,...,Y,0,1,0,0,0,1,1,0,0
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,...,Y,0,0,1,0,0,1,1,0,0

In [19]:
print(df_fnl.dtypes)
print(df_fnl.columns)

Loan_ID                 object
Gender                  object
Married                 object
Dependents              object
Education               object
Self_Employed           object
ApplicantIncome          int64
CoapplicantIncome      float64
LoanAmount             float64
Loan_Amount_Term       float64
Credit_History         float64
Property_Area           object
Loan_Status             object
Gender_Female            uint8
Married_Yes              uint8
Education_Graduate       uint8
Self_Employed_Yes        uint8
Property_Area_Rural      uint8
Property_Area_Urban      uint8
Dependents_0             uint8
Dependents_1             uint8
Dependents_2             uint8
dtype: object
Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status',
       'Gender_Female', 'Married_Yes', 'Education_Graduate',
       'Self_Employed_Yes', 'Property_Area_Rural', 'Property_Area_Urban',
       'Dependents_0', 'Dependents_1', 'Dependents_2'],
      dtype='object')

In [20]:
X = df_fnl[['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History',
       'Gender_Female', 'Married_Yes', 'Education_Graduate',
       'Self_Employed_Yes', 'Property_Area_Rural', 'Property_Area_Urban',
       'Dependents_0', 'Dependents_1', 'Dependents_2' ]]
X.dtypes

ApplicantIncome          int64
CoapplicantIncome      float64
LoanAmount             float64
Loan_Amount_Term       float64
Credit_History         float64
Gender_Female            uint8
Married_Yes              uint8
Education_Graduate       uint8
Self_Employed_Yes        uint8
Property_Area_Rural      uint8
Property_Area_Urban      uint8
Dependents_0             uint8
Dependents_1             uint8
Dependents_2             uint8
dtype: object

In [21]:
y = df_fnl['Loan_Status']

# Model creation

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X , y, test_size=0.15)

In [23]:
from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier()
rf.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

# Evaluation

In [30]:
from sklearn.metrics import accuracy_score, confusion_matrix, precision_score, recall_score

In [31]:
# Train data predictions
train_y_pred = rf.predict(X_train)

In [32]:
# Testing data predictions
test_y_pred = rf.predict(X_test)

In [33]:
print(accuracy_score(y_train, train_y_pred))
#print( precision_score(y_train, train_y_pred))
#print( recall_score(y_train, train_y_pred))
print(confusion_matrix(y_train, train_y_pred))

0.9904030710172744
[[163   3]
 [  2 353]]

In [28]:
print(accuracy_score(y_test, test_y_pred))
#print( precision_score(y_test, test_y_pred))
#print( recall_score(y_test, test_y_pred))
print(confusion_matrix(y_test, test_y_pred))

0.7634408602150538
[[14 12]
 [10 57]]

In [29]:
# Feature importances
sorted(list ( zip(rf.feature_importances_.round(5), X_train.columns.tolist() ) ), reverse=True)

[(0.26686, 'Credit_History'),
 (0.20938, 'LoanAmount'),
 (0.17272, 'ApplicantIncome'),
 (0.11716, 'CoapplicantIncome'),
 (0.03682, 'Loan_Amount_Term'),
 (0.03264, 'Married_Yes'),
 (0.02898, 'Self_Employed_Yes'),
 (0.02361, 'Property_Area_Urban'),
 (0.02329, 'Property_Area_Rural'),
 (0.0228, 'Dependents_0'),
 (0.0223, 'Education_Graduate'),
 (0.01536, 'Dependents_2'),
 (0.01423, 'Gender_Female'),
 (0.01384, 'Dependents_1')]

# Save model

In [41]:
import pickle
with open('../../bank-loan-sklearn-rf.pkl', 'wb') as fid:
    pickle.dump(rf, fid, 2)

In [44]:
X.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Gender_Female', 'Married_Yes',
       'Education_Graduate', 'Self_Employed_Yes', 'Property_Area_Rural',
       'Property_Area_Urban', 'Dependents_0', 'Dependents_1', 'Dependents_2'],
      dtype='object')

# Outcome data

In [45]:
(df.head(1))

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,128.0,360.0,1.0,Urban,Y

In [34]:
df.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [46]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [47]:
input_df = pd.DataFrame()

In [98]:
col_names = ['Gender', 'Married', 'Dependents', 'Education',
             'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 
             'LoanAmount', 'Loan_Amount_Term', 'Credit_History', 
             'Property_Area']
input_vec = ['Male', 'No', '0', 'Graduate', 
             'No', 5849, 0.0, 
             128.0, 360.0, 1.0, 
             'Urban']

In [99]:
input_df = pd.DataFrame(input_vec, col_names)

In [100]:
input_df = input_df.transpose()

In [101]:
gender_list = ['Gender_Female'] 
for gender in gender_list:
    input_df[gender] = 0

In [102]:
marital_list = ['Married_Yes']
for marital in marital_list:
    input_df[marital] = 0

In [103]:
edu_list = ['Education_Graduate']
for edu in edu_list:
    input_df[edu] = 0

In [104]:
self_employed_list = ['Self_Employed_Yes']
for self_employed in self_employed_list:
    input_df[self_employed] = 0

In [105]:
property_area_list = ['Property_Area_Rural', 'Property_Area_Urban']
for property_area in property_area_list:
    input_df[property_area] = 0

In [106]:
dep_list = [ 'Dependents_0', 'Dependents_1', 'Dependents_2']
for dep in dep_list:
    input_df[dep] = 0

In [107]:
input_df.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Gender_Female',
       'Married_Yes', 'Education_Graduate', 'Self_Employed_Yes',
       'Property_Area_Rural', 'Property_Area_Urban', 'Dependents_0',
       'Dependents_1', 'Dependents_2'],
      dtype='object')

In [65]:
df['Education'].unique()

array(['Graduate', 'Not Graduate'], dtype=object)

In [93]:
input_df.head(1)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,Male,No,0,Graduate,No,5849,0,128,360,1,Urban

In [80]:
def determine_gender(input_df):
    if input_df['Gender'][0]=="Female":
        input_df['Gender_Female'] = 1

In [81]:
def determine_married(input_df):
    if input_df['Married'][0]=="Yes":
        input_df['Married_Yes'] = 1

In [82]:
def determine_edu_cat(input_df):
    if input_df['Education'][0]=='Graduate':
        input_df['Education_Graduate'] = 1

In [83]:
def determine_self_emp(input_df):
    if input_df['Self_Employed'][0]=="Yes":
        input_df['Self_Employed_Yes'] = 1

In [84]:
#'Property_Area_Rural', 'Property_Area_Urban'
def determine_prop_area(input_df):
    if input_df['Property_Area'][0]=="Rural":
        input_df['Property_Area_Rural'] = 1 
    elif input_df['Property_Area'][0]=="Urban":
        input_df['Property_Area_Urban'] = 1

In [85]:
# 'Dependents_0', 'Dependents_1', 'Dependents_2'
def determine_dependent(input_df):
    if input_df['Dependents'][0]=="0":
        input_df['Dependents_0'] = 1 
    elif input_df['Dependents'][0]=="1":
        input_df['Dependents_1'] = 1 
    elif input_df['Dependents'][0]=="2":
        input_df['Dependents_2'] = 1

In [108]:
determine_gender(input_df)
determine_married(input_df)
determine_edu_cat(input_df)
determine_self_emp(input_df)
determine_prop_area(input_df)
determine_dependent(input_df)

In [109]:
input_df.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Gender_Female',
       'Married_Yes', 'Education_Graduate', 'Self_Employed_Yes',
       'Property_Area_Rural', 'Property_Area_Urban', 'Dependents_0',
       'Dependents_1', 'Dependents_2'],
      dtype='object')

In [110]:
input_df = input_df[['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Gender_Female', 'Married_Yes',
       'Education_Graduate', 'Self_Employed_Yes', 'Property_Area_Rural',
       'Property_Area_Urban', 'Dependents_0', 'Dependents_1', 'Dependents_2']]

In [111]:
pkl_file = open('../../bank-loan-sklearn-rf.pkl', 'rb')
rf = pickle.load(pkl_file)
prediction = rf.predict(input_df.values)

In [112]:
prediction[0]

'Y'